# GetGradientSpotColor

## Description
Gets the spot color of the specified gradient segment.

```pascal
PROCEDURE GetGradientSpotColor(
				gradient     : HANDLE;
				segmentIndex : INTEGER;
				VAR red      : LONGINT;
				VAR green    : LONGINT;
				VAR blue     : LONGINT);
```

```python
def vs.GetGradientSpotColor(gradient, segmentIndex):
    return (red, green, blue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|gradient|HANDLE|Gradient that contains the segment.|
|segmentIndex|INTEGER|Segment from which to get the data.|(segment indexes begin with 1)|
|red|LONGINT|Red component of the color spot's color.|(red >= 0 and red <= 255)|
|green|LONGINT|Green component of the color spot's color.|(green >= 0 and green <= 255)|
|blue|LONGINT|Blue component of the color spot's color.|(blue >= 0 and blue <= 255)|

## Examples
#### VectorScript ####
```pascal
GetGradientSpotColor(gradientHandle, 4, red, green, blue);
```
#### Python ####
```python
red, green, blue = vs.GetGradientSpotColor(gradientHandle, 4)
```

```pascal
GetGradientSpotColor(gradient, 1, 2, 3, 10);
```
```python
import vs

# Gets the spot color of the specified gradient segment.
gradient = vs.FSActLayer()  # handle to the first selected object on the active layer
segmentIndex = 1

red, green, blue = vs.GetGradientSpotColor(gradient, segmentIndex)
vs.Message('GetGradientSpotColor returned: ' + str((red, green, blue)))
```

## Version
Availability: from VectorWorks10.0

## Category
* Document Attributes